/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package Test;

import java.io.FileOutputStream;
import java.io.IOException;
import java.util.Properties;
import main.Constants;

/**
 *
 * @author Я
 */
public class initProperties {
    public static void main(String... args) {
        Properties properties = new Properties();
        try {
            FileOutputStream fos = new FileOutputStream(Constants.CONFIGS_URL);
            Properties p = new Properties();
            p.put("xShift", "-45");
            p.put("yShift", "15");
            p.put("cars","{\"АВ 1665-6\":\"Мерседес Бенс\",\"АI 2142-6\":\"Мерседес Бенс\",\"АВ 9369-6\":\"Мерседес Бенс\",\"АВ 4968-6\":\"Мерседес Бенс\",\"АВ 0619-6\":\"Мерседес Бенс\",\"АВ 1699-6\":\"Мерседес Бенс\",\"АВ 8837-6\":\"Мерседес Бенс\",\"АВ 8843-6\":\"Мерседес Бенс\",\"АВ 1704-6\":\"Мерседес Бенс\",\"АВ 8838-6\":\"Мерседес Бенс\",\"АЕ 1004-6\":\"Мерседес Бенс\",\"АА 8984-6\":\"Мерседес Бенс\",\"АВ 9236-6\":\"Мерседес Бенс\",\"АВ 4967-6\":\"Мерседес Бенс\",\"АЕ 3006-6\":\"Мерседес Бенс\",\"АВ 3319-6\":\"Мерседес Бенс\",\"АВ 4879-6\":\"Мерседес Бенс\",\"АА 7366-6\":\"Мерседес Бенс\",\"АI 0605-6\":\"Мерседес Бенс\",\"АА 7615-6\":\"Мерседес Бенс\",\"АЕ 5926-6\":\"Мерседес Бенс\",\"АЕ 7890-6\":\"Мерседес Бенс\",\"АЕ 9398-6\":\"Мерседес Бенс\",\"АЕ 1435-6\":\"Мерседес Бенс\",\"AI 0146-6\":\"Мерседес Бенс\",\"АЕ 0102-6\":\"Мерседес Бенс\",\"АЕ 9399-6\":\"Мерседес Бенс\",\"АА 5336-6\":\"Мерседес Бенс\",\"АВ 6101-6\":\"Мерседес Бенс\",\"АI 0603-6\":\"Мерседес Бенс\",\"АВ 4880-6\":\"Мерседес Бенс\",\"АВ 9767-6\":\"Мерседес Бенс\",\"АВ 1677-6\":\"Мерседес Бенс\",\"АВ 0351-6\":\"Мерседес Бенс\",\"АВ 1673-6\":\"Мерседес Бенс\",\"АЕ 0973-6\":\"Мерседес Бенс\",\"АЕ 0087-6\":\"Мерседес Бенс\",\"AI 1168-6\":\"Мерседес Бенс\",\"AI 1172-6\":\"Мерседес Бенс\",\"АВ 3476-6\":\"Мерседес Бенс\",\"АЕ 0067-6\":\"Мерседес Бенс\",\"АЕ 0121-6\":\"Мерседес Бенс\",\"АЕ 0187-6\":\"Мерседес Бенс\",\"АЕ 0188-6\":\"Мерседес Бенс\",\"АЕ 0056-6\":\"Мерседес Бенс\",\"АА 5064-6\":\"Мерседес Бенс\",\"АЕ 0101-6\":\"Мерседес Бенс\",\"АЕ 0057-6\":\"Мерседес Бенс\",\"АВ 6196-6\":\"Мерседес Бенс\",\"AI 1169-6\":\"Мерседес Бенс\",\"АВ 1019-6\":\"Мерседес Бенс\",\"АВ 7823-6\":\"Мерседес Бенс Атега\",\"АЕ 4763-6\":\"Мерседес Бенс Атега\",\"АЕ 8869-6\":\"Мерседес Бенс Атега\",\"АЕ 1609-6\":\"Мерседес Бенс Атега\",\"АВ 8990-6\":\"Мерседес Бенс Атега\",\"АВ 7315-6\":\"Мерседес Бенс Атега\",\"АА 7685-6\":\"Фольксваген Крафтар\",\"АА 7684-6\":\"Фольксваген Крафтар\",\"АI 1838-6\":\"Фольксваген Крафтар\",\"АI 0634-6\":\"Фольксваген Крафтар\",\"АА 7683-6\":\"Фольксваген Крафтар\",\"АI 1840-6\":\"Фольксваген Крафтар\",\"АА 3643-6\":\"Фольксваген Крафтар\",\"АА 3161-6\":\"Фольксваген Крафтар\",\"АI 2123-6\":\"Фольксваген Крафтар\",\"АА 3199-6\":\"Фольксваген Крафтар\",\"АI 3377-6\":\"Ивека Дели\",\"AI 1894-6\":\"Ивека Дели\"}");
            p.store(fos, "");
        } catch(IOException e) {
            e.printStackTrace();
        }
    }
}
